netsuite/netsuite-connector/netsuite-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapRequests/netsuite/esb_updateList_mandatory.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.netsuite">
  <soapenv:Header/>
   <soapenv:Body>
      <urn:apiUrl>%s(apiUrl)</urn:apiUrl>
      <urn:method>updateList</urn:method>
      <urn:warningAsError/>
      <urn:disableMandatoryCustomFieldValidation/>
      <urn:disableSystemNotesForCustomFields/>
      <urn:ignoreReadOnlyFields/>
      <urn:partnerId/>
      <urn:applicationId/>
      <urn:email>%s(email)</urn:email>
      <urn:password>%s(password)</urn:password>
      <urn:account>%s(account)</urn:account>
      <urn:roleInternalId/>
      <urn:roleExternalId/>
      <urn:roleType/>
      <urn:roleName/>
      <urn:records>
        <platformMsgs:record internalId="%s(addListMandatoryInternalId)" xsi:type="listRel:Customer" 
         xmlns:listRel="urn:relationships_2014_1.lists.webservices.netsuite.com" 
         xmlns:platformMsgs="urn:messages_2014_1.platform.webservices.netsuite.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <listRel:companyName>%s(companyNameUpdated)</listRel:companyName>
            <listRel:entityId>%s(customerNameUpdated)</listRel:entityId>
         </platformMsgs:record>
		</urn:records>
   </soapenv:Body>
</soapenv:Envelope>